Repository: schlom/Praktomat
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: de

source: Of course, you haven't actually done any work yet. Next, start your first app by running <code>python manage.py startapp [app_label]</code>.
de: Natürlich ist hier noch nichts weiter zu sehen. Bitte als Nächstes eine neue Anwendung durch Ausführen von <code>python manage.py startapp [app_label]</code> anlegen.

source: You're seeing this message because you have <code>DEBUG = True</code> in your Django settings file and you haven't configured any URLs. Get to work!
de: Diese Mitteiling ist sichtbar weil in der settings.py-Datei <code>DEBUG = True</code> steht und die URLs noch nicht konfiguriert sind.

source: No year specified
de: Kein Jahr angegeben

source: No month specified
de: Kein Monat angegeben

source: No day specified
de: Kein Tag angegeben

source: No week specified
de: Keine Woche angegeben

source: No %(verbose_name_plural)s available
de: Keine %(verbose_name_plural)s verfügbar

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
de: In der Zukunft liegende %(verbose_name_plural)s sind nicht verfügbar, da %(class_name)s.allow_future auf False gesetzt ist.

source: Invalid date string '%(datestr)s' given format '%(format)s'
de: Ungültiges Datum '%(datestr)s' für das Format '%(format)s'

source: No %(verbose_name)s found matching the query
de: Konnte keine %(verbose_name)s mit diesen Parametern finden.

source: Page is not 'last', nor can it be converted to an int.
de: Weder ist dies die letzte Seite ('last') noch konnte sie in einen ganzzahligen Wert umgewandelt werden.

source: Invalid page (%(page_number)s): %(message)s
de: Ungültige Seite (%(page_number)s): %(message)s

source: Empty list and '%(class_name)s.allow_empty' is False.
de: Leere Liste und '%(class_name)s.allow_empty' ist False.

source: Directory indexes are not allowed here.
de: Dateilisten sind untersagt.

source: "%(path)s" does not exist
de: "%(path)s" existiert nicht

source: Index of %(directory)s
de: Verzeichnis %(directory)s

source: created
de: erstellt

source: modified
de: geändert

source: title
de: Titel

source: slug
de: Kürzel

source: description
de: Beschreibung

source: Inactive
de: Inaktiv

source: Active
de: Aktiv

source: keep empty for an immediate activation
de: Bitte freilassen für schnelle Aktivierung

source: keep empty for indefinite activation
de: Bitte freilassen für unbegrenzte Aktivierung

source: Lookup
de: Suchen

source: Error running spellchecker
de: Spellchecker kann nicht ausgeführt werden
