Repository: schlom/Praktomat
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: de

source: This text will be displayed under Charfield in the admin.
de: Dieser Text wird in einem Char-Feld dargestellt als Admin

source: Setting
de: Einstellungen

source: Settings
de: Einstellungen

source: Personal info
de: Persönliche Informationen

source: Permissions
de: Berechtigungen

source: Groups
de: Gruppen

source: Important dates
de: Wichtige Daten

source: Account activation on %s for %s (%s)
de: Account aktiviert am %s für %s (%s)

source: Account activation on %s
de: Account aktiviert am %s

source: Regular expression used to check the email domain of registering users.
de: Regular expression um die E-Mail Domain des sich registrierenden Nutzers zu prüfen.

source: Regular expression used to check the student number.
de: Regular expression prüft die Nummer des Studenten.

source: If enabled, users previously unknown to the Praktomat can register via sigle sign on (eg. Shibboleth).
de: Bei Aktivierung können sich vorher unbekannte Teilnehmer anmelden mittels Single Sign On (z.B. Shibboleth).

source: After this date, registration wont be possible.
de: Nach Ablauf dieses Datums sind Registrierungen nicht mehr möglich.

source: Days until the user has time to activate his account with the link send in the registation email.
de: Tage die dem Nutzer noch zur Verfügung stehen, um das Benutzerkonto mit dem per E-Mail versendeten Link zu aktivieren.

source: If enabled, registrations via the website must be manually validate by a trainer.
de: Bei Aktivierung müssen die Registrierungen von einem Trainer manuell geprüft werden.

source: If enabled, solutions with required checkers, which are not passed, can become the final soution.
de: Bei Aktivierung können Lösungen, die nicht bestanden wurden, zu finalen Lösungen werden.

source: If enabled, the tutor can't see the name of the user, who subbmitted the solution.
de: Bei Aktivierung kann der Tutor nicht den Namen des Nutzers sehen, der die Lösung eingereicht hat.

source: If enabeld, all users can see their final grades.
de: Bei Aktivierung können alle Nutzer ihre Abschlussbewertungen sehen.

source: If enabeld, users will not learn which tutor wrote attestations to his solutions. In particular, tutors will not be named in Attestation-Emails.
de: Bei Aktivierung wissen die Nutzer nicht, welcher Tutor Bescheinigungen für sie ausgestellt hat. Tutoren werden nicht nametlich erwähnt in den Bescheinigungs-E-Mails.

source: Addiotional Reply-To: Address to be set for Attestation emails.
de: Zusätzliche Antwort an: Adresse die Bescheinigungs-E-Mails erhalten soll.

source: If enabled, tutors can re-run all checkers for solutions they attest. Can be used to re-run checks that failed due to problems unrelated to the solution (e.g.: time-outs because of high server-load), but needs to be used with care, since it may change the results from what the student saw when he submitted his solution.
de: Bei Aktivierung können Tutoren alle Teste erneut auf die Lösungen anwenden die sie bescheinigen. Kann genutzt werden, um die Tests die nicht bestanden wurden erneut durchzuführen. Z.B. könnten Time-Out aufgrund hoher Server-Last dafür verantwortlich sein. Dies sollte aber mit Bedacht genutzt werden, da bereits existierende Bewertungen, die ein Student schon sah, überschrieben werden könnten.

source: Default settings for jPlag
de: Standardeinstellungen für jPlag

source: The tutorial the student belongs to.
de: Die Übung zudem der Student gehört.

source: The final grade for the whole class.
de: Das finale Ergebnis für den gesamten Kurs.

source: The programme the student is enlisted in.
de: Das Programm für das der Student eingeschrieben ist.

source: activation key
de: Aktivierungs Schlüssel

source: Users
de: Nutzer

source: The name of the tutorial
de: Der Name der Übung

source: The tutors in charge of the tutorium.
de: Die Übung für die die Tutoren zuständig sind.

source: Tutors
de: Tutoren

source: Tutorial
de: Übung

source: Tutorials
de: Übungen

source: Comment which is shown to the user.
de: Kommentar das dem Benutzer gezeigt wird

source: Comment which is only visible to tutors
de: Kommentar das nur dem Tutoren sichtbar ist

source: The mark for the whole solution.
de: Die Note für die komplette Lösung

source: Indicates whether the attestation is ready to be published
de: Zeigt an, ob die Bescheinigung veröffentlicht werden kann

source: Indicates whether the user can see the attestation.
de: Zeigt an, ob der Benutzer die Bescheinigung sehen kann.

source: The Date/Time the attestation was published.
de: Das Datum und die Zeit an dem die Bescheinigung veröffentlicht wurde.

source: New attestation for your solution of the task '%s'
de: Neue Bescheinigung für Ihre Lösung der Übung '%s'

source: Attestation for your solution of the task '%s' withdrawn
de: Bescheinigung für Lösung der Übung '%s' verworfen

source: The content of the solution file annotated by the tutor.
de: Der Inhalt der Lösung wurde vom Tutor kommentiert.

source: The Name of the Aspect to be rated. E.g.: "Readabylity"
de: Der Name des Gesichtspunkts der gewertet werden soll. Z.B.: "Lesbarkeit"

source: Description of the Aspect and how it should be rated. E.w.: "How well is the code structured?"
de: Beschreibung des Gesichtspunkts und wie er gewertet werden soll. Z.B.: "Wie gut ist der Quellcode strukturiert?"

source: The Name of the rating scale for the aspects. E.g.: "School marks"
de: Der Name der Wertungsskala für den Gesichtspunkt. Z.B.: "Schulnoten"

source: The Name of the item(mark) in the rating scale. E.g.: "A" or "very good"
de: Der Name des Wertes(Note) in der Wertungsskala. Z.B.: "1" oder "sehr gut"

source: Defines the order in which the items are sorted. Lowest is best.
de: Definiert fie Reihenfolge in der die Werte sortiert werden. Niedrigster ist am besten.

source: This JavaScript will calculate a recommend end note for every user based on final grade of every task.
de: Diese JavaScript berechnet eine vorgeschlagene Endnote für jeden Benutzer basierend auf den Ergebnissen der Aufgaben.

source: Determines the order in wich the checker will start. Not necessary continuously!
de: Legt die Reihenfolge der Checker fest. Nicht fortlaufend notwendig!

source: Test results are displayed to the submitter.
de: Testergebnisse werden dem Einreicher angezeigt.

source: The test must be passed to submit the solution.
de: Der Test muss bestanden sein um diesen als Lösung einzureichen.

source: The test will run on submission time.
de: Der Test läuft bei Einreichung.

source: If this test fails, do not display further test results.
de: Falls der Test fehlschlägt, zeige keine weiteren Testergebnisse.

source: Indicates whether the test has been passed
de: Zeigt an, ob der Test bestanden wurde.

source: Text result of the checker
de: Textergebnis des Checkers

source: Runtime in milliseconds
de: Laufzeit in Millisekunden

source: Artefact produced by a checker
de: Durch Checker erstelltes Artefakt

source: Ensure anonymous submission
de: Anonyme Einreichung sicherstellen

source: This check fails if a submitted file contains your first or last name.
de: Diese Test schlägt fehl, falls die eingereichte Datei Ihren Vor- oder Nachnamen beinhaltet.

source: The file contains your name or user id:
de: Die Datei enthält Ihren Namen oder die Benutzer-Id:

source: <p>Praktomat supports <em>anonymous marking</em>, i.e. the person who marks only sees your submission, but not your name or identity. To allow anonymous marking, your name and user id is not allowed to appear in your submission.<p> Please remove your name and user id and submit again.
de: <p>Praktomat unterstützt <em>anonyme Korrekturen</em>, das heißt, die Person welche korrigiert, sieht nur Ihre Einreichung aber nicht Ihren Namen oder Ihre Identität. Um anonyme Korrekturen zuzulassen, dürfen Ihr Name und Identität in der Einreichung nicht auftauchen.<p> Bitte entfernen Sie Ihren Namen und Identität und reichen die Lösung nochmal ein.

source: Name to be displayed on the solution detail page.
de: Name der auf der detaillierten Lösungsseite angzeigt werden soll.

source: XML configuration of CheckStyle. See http://checkstyle.sourceforge.net/
de: XML Konfiguration von CheckStyle. Siehe http://checkstyle.sourceforge.net/

source: The file that is copied into the sandbox
de: Die Datei die in die Sandbox kopiert wird

source: What the file will be named in the sandbox. If empty, we try to guess the right filename!
de: Wie die Datei in der Sandbox benannt wird. Falls keine Eingabe getätigt wird,wird versucht der richtige Name zu erraten!

source: Subfolder in the sandbox which shall contain the file.
de: Unterordner in der Sandbox, die die Datei enthalten sollte.

source: Unpack the zip file into the given subfolder. (It will be an error if the file is not a zip file; the filename is ignored.)
de: Entpacken Sie das Zip-File in den Unterordner. (Fehler falls kein Zip-File! Der Dateiname wird ignoriert.)

source: The name of the Test
de: Der Name des Tests

source: The shell script whose output for the given input file is compared to the given output file: The substrings JAVA and PROGRAM got replaced by Praktomat determined values.
de: Die Ausgabe des Shell-Scripts wird mit der gegebenen Ausgabedatei verglichen. Hierzu wird eine Eingabedatei verwendet. Die Zeichenfolgen JAVA und PROGRAM werden durch den Praktomaten durch festgelegte Werte ersetzt.

source: The file containing the input for the program.
de: Datei die die Eingaben für das Programm beinhaltet.

source: The file containing the output for the program.
de: Datei die die Ausgaben für das Programm beinhaltet.

source: Description of the Testcase. To be displayed on Checker Results page when checker is unfolded.
de: Beschreibung des Testcase. Wird in den Testergebnissen angezeigt.

source: Name of the Testcase. To be displayed as title on Checker Results page
de: Name des Testcase. Wird als Titel auf der Testresultatseite angezeigt.

source: space-seperated list of files to be ignored during compilation
de: Liste an Dateien, die während der Kompilierung ignoriert werden (space-seperated).

source: The name of the interface that must be implemeted.
de: Name des Interfaces, welches Implementiert werden muss.

source: The fully qualified name of the test case class (without .class)
de: FQN der Testcase-Klasse (ohne .class)

source: Description of the Testcase. To be displayed on Checker Results page when checker is unfolded.
de: Beschreibung des Testcase. Wird in den Testergebnissen angezeigt.

source: The name of the file to preserve (e.g. out.txt)
de: Name der Datei die aufbewahrt werden soll (z.B. out.txt)

source: Lexical statistics
de: Lexikalische Statistiken

source: This check is always passed.
de: Dieser Test wird immer bestanden.

source: {0} files, {1} lines, including {2} code lines ({3}%), {4} comment lines ({5}%), {6} both ({7}%).
de: {0} Dateien, {1} Zeilen, beinhalten {2} Zeilen Code ({3}%), {4} Kommentierte Zeilen ({5}%), {6} Beides ({7}%).

source: The maximum length of a line of code.
de: Maximale Zeilenbreite

source: The amount of characters a tab represents.
de: Anzahl der Zeichen die einen Tab repräsentieren.

source: Regular expression describing the filenames to be checked. Case Insensetive. Blank: use all files.
de: Regular Expression die definiert, welche Dateinamen überprüft werden sollen. Case Insensetive. Leer: Alle Dateien.

source: Regular expression describing included filenames, which shall be excluded. Case Insensetive. Blank: use all files.
de: Regular Expression die definiert, welche Dateinamen ausgeschlossen werden sollen. Case Insensetive. Leer: Alle Dateien.

source: A script (e.g. a shell script) to run. Its output will be displayed to the user (if public), the checker will succeed if it returns an exit code of 0. The environment will contain the variables JAVA and PROGRAM.
de: Ein Script (z.B. ein Shell Script), das ausgefürt werden soll. Die Ausgabe wird dem Benutzer angezeigt (wenn Public). Der Test ist erfolgreich bei Exit Code 0. Die Variablen JAVA und PROGRAM werden gesetzt.

source: Regular expression describing passages to be removed from the output.
de: Regular Expression die beschreibt, welche Abschnitte der Ausgabe entfernt werden sollen.

source: If the script doesn't return HTML it will be enclosed in &lt; pre &gt; tags.
de: Falls das Script kein HTML zurückliefert, wird die Rückgabe mit &lt; pre &gt; umschlossen.

source: The text that has to be in the solution.
de: Text der in der eingereichten Lösung vorkommen muss.

source: Output flags. '%s' will be replaced by the program name.
de: Output flags. '%s' werden durch den Programmnamen ersetzt.

source: Compiler libraries
de: Compiler Bibliotheken

source: Regular expression describing all source files to be passed to the compiler.
de: Regular Expression beschreibt, welche Dateien an den Compiler weitergereicht werden.

source: Is a submission required to provide a main method?
de: Muss die Einreichung eine main-Methode enthalten?

source: The file of type %s is not supported.
de: Die Datei vom Typ %s wird nicht unterstützt.

source: The zip file seams to be corrupt.
de: Die Zip-Datei scheint korrupt zu sein.

source: The zip file is to big.
de: Die Zip-Datei ist zu groß.

source: The file '%(file)s' of guessed mime type '%(type)s' in this zip file is not supported.
de: Die Datei '%(file)s' des erkannten MIME-Type '%(type)s' innerhalb der Zip-Datei wird nicht unterstützt.

source: Uhoh - something unexpected happened.
de: Achtung - etwas unerwartetes trat auf.

source: The tar file is to big.
de: Die Tar-Datei ist zu groß.

source: The file '%(file)s' of guessed mime type '%(type)s' in this tar file is not supported.
de: Die Datei '%(file)s' des erkannten MIME-Type '%(type)s' innerhalb der Tar-Datei wird nicht unterstützt.

source: The file '%(file)s' is bigger than %(size)iKB which is not supported.
de: Die Datei '%(file)s' ist größer als %(size)iKB.

source: You must at least choose one file.
de: Mindestens eine Datei muss ausgewählt werden.

source: Id unique in task and user.Eg. Solution 1 of user X in task Y in contrast to global solution Z
de: ID einzigartig in Aufgabe und Benutzer. Z.B.: Lösung 1 von Benutzer X in der Aufgabe Y im Vergleich zu der allgemeinen Lösung Z

source: Indicates whether this solution is a test upload.
de: Zeigt an, ob die Lösung ein Test-Upload ist.

source: Indicates whether the solution has passed all public and required tests.
de: Zeigt an, ob alle öffentlichen und notwendigen Test für die Lösung bestanden wurden.

source: Indicates whether the solution has at least failed one public and not required tests.
de: Zeigt an, ob mindestens ein öffentlicher und kein notwendiger Test für die Lösung fehlgeschlagen ist.

source: Indicates whether the solution is a rip-off of another one.
de: Zeigt an, ob die Lösung ein Plagiat einer anderen ist.

source: Indicates whether this solution is the last (accepted) of the author.
de: Zeigt an, ob die Lösung die letzte (akzeptierte) des Autors ist.

source: Source code file as part of a solution an archive file (.zip, .tar or .tar.gz) containing multiple solution files.
de: Die Quellcodedatei als Teil einer Lösung eine Archive-Datei (.zip, .tar oder .tar.gz) beinhaltet mehrere Lösungsdateien.

source: Guessed file type. Automatically set on save().
de: Geschätzter Dateityp. Automatisch auf save() gesetzt.

source: %s submission confirmation
de: %s Bestätigte Einreichung

source: [%s] lost final submission confirmation
de: [%s] abschließende Bestätigung der Einreichung verloren

source: %s lost final submission confirmation
de: %s abschließende Bestätigung der Einreichung verloren

source: The name of the Task
de: Der Name für die Aufgabe

source: Description of the assignment.
de: Erläuterung zur Aufgabe.

source: The time on which the user will see the task.
de: Ab wann der Benutzer die Aufgabe sehen kann.

source: The time up until the user has time to complete the task. This time will be extended by one hour for those who just missed the deadline.
de: Bis wann die Nutzer Zeit haben die Aufgabe zu lösen. Die Zeit wird um eine Stunde verlängert für jene die die Abgabefrist verpasst haben.

source: Number of submissions a user can make before waitdelta got active
de: Anzahl an Einreichungen die ein Nutzer tätigen kann, bevor eine Wartezeit (waitdelta) aktiv wird.

source: Timedelta in minutes. The user must wait before submitting the next solution of same task: Timedelta multiplied with number of current uploads
de: Wartezeit in Minuten. Nutzer muss diese Zeit warten, bevor er eine weitere Lösung einreichen darf: Die Wartezeit wird mit der Anzahl der aktuellen Einreichungen multipliziert!!!

source: Number of uploads a user can submit for the same task. Value -1 means unlimited
de: Anzahl an Einreichungen, die ein Benutzer für diese Aufgabe zur Verfügung hat. -1 bedeutet unbegrenzt

source: Regular Expression describing the mime types of solution files that the user is allowed to upload.
de: Regular Expression die die MIME Types definiert, die Benutzer hochladen dürfen.

source: The maximum size of an uploaded solution file in kilobyte.
de: Maximale Größe einer hochgeladenen Datei in Kilobyte

source: Indicates whether the checker which don't run immediately on submission have been executed.
de: Zeigt an,ob der Checker, der nicht direkt bei Einreichung lief, durchgeführt wurde.

source: The scale used to mark the whole solution.
de: Skala zur Bewertung für die Lösungen.

source: Indicates that only trainers may publish attestations. Otherwise, tutors may publish final attestations within their tutorials.
de: Zeigt an, dass nur Trainer Bescheinigung veröffentlichen können. Ansonsten können Tutoren Bescheinigung innerhalb ihrer Übungen veröffentlichen.

source: No new solution uploads since the last jPlag run
de: Es wurden keine neuen Lösungen hochgeladen seit der letzten Ausführung von JPlag

source: Access denied
de: Zutritt verweigert

source: Import %(name)s
de: Importiere %(name)s

source: Import tutorial assignment
de: Imortiere Übungsaufgabe

source: Add %(name)s
de: Füge %(name)s hinzu

source: Import User
de: Importiere Nutzer

source: Please correct the error below.
de: Bitte korrigieren sie den nachstehenden Fehler

source: Save
de: Speichern

source: Generate %(name)s
de: Generiere %(name)s

source: Generate ratingScale
de: Generiere Bewertungsskala

source: Assign by matriculation number
de: Per Matrikelnummer zuordnen

source: History
de: Verlauf

source: Model Solution
de: Musterlösung

source: Save this task to add a model solution
de: Aufgabe speichern, um eine Musterlösung hinzuzufügen

source: View on site
de: Auf Seite anzeigen

source: Auth
de: Autentifizierung

source: Group
de: Gruppe

source: Import matriculation list
de: Importiere Matrikelnummernliste

source: Praktomat admin: %(title)s
de: Praktomat-Administrator: %(title)s

source: User site
de: Nutzeransicht

source: Add another %(verbose_name)s
de: Weiteren hinzufügen %(verbose_name)s

source: Remove
de: Entfernen

source: Download Final Solutions
de: Finale Lösung herunterladen

source: Tasks
de: Aufgaben

source: Task
de: Aufgabe

source: Import Task
de: Aufgabe importieren

source: Checker results
de: Testergebnisse

source: Matriklnr
de: Marikelnummer

source: Existing Attestations
de: Existierende Bescheinigungen

source: not finished
de: nicht abgeschlossen

source: final but unpublished
de: final aber nicht veröffentlicht

source: final and published
de: final und veröffentlicht

source: view only
de: nur einsehen

source: Upload a test solution
de: Testlösung hochladen

source: Download all solutions
de: Alle Lösungen downloaden

source: Download all solutions, including checker files
de: Alle Lösungen und Testdateien downloaden

source: Unrated
de: Nicht Bewertet

source: Not final
de: Nicht Final

source: Solution by
de: Lösung von

source: All solutions have been attested.
de: Alle Lösungen wurden attestiert.

source: solutions to attest.
de: Lösungen zu bewerten.

source: The solutions of
de: Die Lösung von

source: have been marked as plagiarism.
de: wurde als Plagiat markiert.

source: solutions have been marked as plagiarism.
de: Lösungen wurden als Plagiat markiert.

source: There already are Attestations for the
de: Es existieren bereits Bescheinigungen für

source: specified solution
de: die angegebene Lösung

source: . Do you want to
de: . Möchten Sie

source: force the creation
de: die Erstellung erzwingen

source: of another Attestation?
de: für eine weitere Bescheinigung?

source: Attestation for
de: Bescheinigung für die

source: Solution
de: Lösung

source: by
de: von

source: Created:
de: Erstellt am:

source: Solution by:
de: Lösung von:

source: Model solution
de: Musterlösung

source: Annotate solution files
de: Lösungen kommentieren

source: Attest solution
de: Lösung bescheinigen

source: Download (incl. checker files)
de: Download (inkl. Testdateien)

source: re-run all checkers
de: Alle Tests erneut durchführen

source: Annotated solution files
de: Kommentierte Lösungen

source: Editor Options
de: Editor-Optionen

source: Marked as Plagiarism
de: Als Plagiat markiert

source: Hello
de: Hallo

source: your solution to the task "%(task)s" has been attested.
de: Ihre Lösung für die Aufgabe "%(task)s" wurde bescheinigt.

source: your solution to the task "%(task)s" has been attested by %(by)s.
de: Ihre Lösung für die Aufgabe "%(task)s" wurde bescheinigt von %(by)s.

source: Thanks for using our site!
de: Danke für die Nutzung unsrer Seite!

source: The %(site_name)s team
de: Das %(site_name)s Team

source: The task is not yet expired.
de: Die Aufgabe ist noch nicht ausgelaufen

source: Not all checker have yet been run.
de: Noch nicht alle Tests (Checker) wurden ausgeführt.

source: Attestation Progress by Tutor
de: Bescheinigungsverlauf Tutor

source: Unattested solutions
de: Unbescheinigte Lösungen

source: My attestations
de: Meine Bescheinigungen

source: Attestations by other tutors
de: Bescheinigungen anderer Tutoren

source: All attestations
de: Alle Bescheinigungen

source: Attestation
de: Bescheinigung

source: Preview
de: Vorschau

source: My solutions
de: Meine Lösungen

source: Private Comment
de: Privates Kommentar

source: Comment
de: Kommentar

source: Ratings
de: Bewertungen

source: Final grade:
de: Endgültiges Resultat:

source: Download Solution
de: Lösungen herunterladen

source: Rating Scale
de: Bewertungsskala

source: Rating Scales
de: Bewertungsskalen

source: Rating Scale Item
de: Bewertungsskalathema

source: Rating Scales Items
de: Bewertungsskalathemen

source: Rating scales
de: Bewertungsskalen

source: Files
de: Dateien

source: Annotated Files
de: Kommentierte Dateien

source: the attestation of your solution to the task "%(task)s" has been withdrawn by %(by)s.
de: Die Bescheinigung Ihrer Lösung für die Aufgabe "%(task)s" wurde zurückgezogen von %(by)s.

source: Other Tutorials
de: Andere Übungen

source: Rating Aspect
de: Bewertungsaspekt

source: Rating Aspects
de: Bewertungsaspekte

source: Rating Overview
de: Bewertungsübersicht

source: Email all users
de: Allen Teilnehmern eine E-Mail senden

source: Export as csv (utf-8)
de: Als CSV (utf-8) exportieren

source: User
de: Nutzer

source: Accounts
de: Benutzerkonten

source: Calculated grade
de: Berechnete Bewertung

source: Final grade
de: Finale Bewertung

source: Average:
de: Durchschnitt:

source: take all
de: Alle übernehmen

source: Statistics
de: Statistiken
