Repository: schlom/Praktomat
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: de

source: Shows the dates on which solution submissions were made. Final submissions indicate when users uploaded their newest solution. Total submissions shows the percantage of active users who have submitted at least one solution.
de: Zeigt die Daten an denen Lösungen eingereicht wurden. Endgültige Einreichungen weisen darauf hin, dass Nutzer ihre aktuellste Lösung hochgeladen haben. Gesamte Einreichungen stellen aktive Nutzer in Prozent dar, die mindestens eine Lösung eingereicht haben.

source: This chart plots on which time of day the users were most active.
de: Dieses Diagramm zeigt zu welcher Tageszeit die Nutzer am aktivsten waren.

source: This chart gives an overview of how many attestations are ready to be published and how many of these are already published by the tutors.
de: Dieses Diagramm gibt eine Übersicht adrüber, wieviele Bescheinigungen für die Veröffentlichung fertiggestellt wurden und wieviele bereits veröffentlicht sind.

source: Shows the time it took to process each of the checkers.
de: Zeigt die Zeit, die benötigt wurde um die Tests durchzuführen.

source: No Tutorial
de: Keine Übungen

source: You don't supervise any Tutorial.
de: Sie betreuen keine Übung

source: Welcome,
de: Willkommen,

source: Log-out
de: Abmelden

source: Rating overview
de: Bewertungsübersicht

source: My Tutorial
de: Meine Übungen

source: Register
de: Registrieren

source: Retrieve password
de: Passwort zurücksetzten

source: Password change
de: Passwort ändern

source: Password change successful
de: Passwort ändern war erfolgreich

source: Your password was changed.
de: Ihr Passwort wurde geändert.

source: Please enter your old password, for security's sake, and then enter your new password twice so we can verify you typed it in correctly.
de: Bitte geben Sie das alte Passwort ein und dann geben Sie zweimal das neue Passwort ein.

source: Old password:
de: Altes Passwort:

source: New password:
de: Neues Passwort:

source: Confirm password:
de: Passwort bestätigen:

source: Change my password
de: Passwort ändern

source: Password reset
de: Passwort zurücksetzten

source: Password reset complete
de: Passwort zurücksetzten erfolgreich

source: Your password has been set. You may go ahead and log in now.
de: Ihr Passwort wurde übernommen. Fahren Sie fort und melden Sie sich an.

source: Log in
de: Anmelden

source: Enter new password
de: Geben Sie ein neues Passort ein

source: Please enter your new password twice so we can verify you typed it in correctly.
de: Bitte geben Sie das neue Passwort zweimal ein.

source: Password reset unsuccessful
de: Passwort zurücksetzten nicht erfolgreich

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
de: Das Zurücksetzten des Passorts ist ungültig. Eventuell wurde dieser schon durchgeführt. Beantragen Sie ein neuse Passwort.

source: Password reset successful
de: Zurücksetzen des Passorts erfolgreich

source: We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.
de: Wir haben Ihnen Anweisungen zum erstellen Ihres Passworts an Ihre E-Mail weitergeleitet. Sie sollten diese E-Mail bald erhalten.

source: You're receiving this e-mail because you requested a password reset
de: Sie erhalten diese E-Mail, weil Sie das Zurücksetzen des Passworts beantragt haben

source: for your user account at %(site_name)s
de: Für Ihren Nutzer Account bei %(site_name)s

source: Please go to the following page and choose a new password:
de: Bitte gehen Sie auf folgende Seite und wählen ein neues Passwort:

source: Your username, in case you've forgotten:
de: Ihr Name, falls Sie ihn vergessen haben sollten:

source: Forgot your password? Enter your e-mail address below, and we'll e-mail instructions for setting a new one.
de: Passwort vergessen? Geben Sie Ihre E-Mail-Adresse an.

source: E-mail address:
de: E-Mail-Adresse:

source: Reset my password
de: Mein Passwort zurücksetzten

source: Activation
de: Aktivierung

source: Activation successful,Activation unsuccessful
de: Aktivierung erfolgreich, Aktivierung nicht erfolgreich

source: You have successfully activated your account. You can now login.
de: Sie haben Ihren Zugang erfolgreich aktiviert. Sie können sich nun anmelden.

source: Your activation has failed due to one of the following reasons:
de: Ihre Aktivierung ist fehlgeschlagen aus einem der folgenden Gründe:

source: The activation period of %(expiration_days)s days has expired.
de: Der Aktivierungszeitraum von %(expiration_days)s ist abgelaufen.

source: The activation code was already succsessfully used. You may try to log in.
de: Der Aktivierungscode wurde bereits verwendet. Versuchen Sie sich anzumelden.

source: The activation code is invalid.
de: Der Aktivierungscode ist ungültig.

source: An account with the same matnumber was already activated.
de: Ein Account mit der gleichen Matrikelnummer existiert bereits.

source: Registration
de: Registrierung

source: Activation enabled
de: Aktivierung freigegeben

source: The user has received an e-Mail containing his activation code.
de: Der Nutzer hat eine E-Mail erhaltin mit Aktivierungscode.

source: First name:
de: Vorname:

source: Second name:
de: Nachname:

source: Field of study:
de: Studiengang:

source: Username:
de: Benutzername

source: Matr. Number:
de: Matrikelnummer:

source: eMail Address:
de: E-Mail Adresse:

source: Full Name:
de: Vollständiger Name:

source: Change Account
de: Benutzerkonto ändern

source: Change Password
de: Passwort ändern

source: Registration successful
de: Registrierung erfolgreich

source: We've e-mailed you instructions for activating your account to the e-mail address you submitted. You should be receiving it shortly.
de: Wir haben Ihnen Anweisungen zum erstellen Ihres Passworts an Ihre E-Mail weitergeleitet. Sie sollten diese E-Mail bald erhalten.

source: You're receiving this e-mail because you registerd an account at %(site_name)s
de: Sie erhalten diese E-Mail aufgrund einer Registrierung bei %(site_name)s

source: Please go to the following page to activate your account within %(expiration_days)s days
de: Bitte gehen Sie auf folgende Seite um Ihren Account innerhalb von %(expiration_days)s zu aktivieren.

source: A user has registered an account on %(site_name)s
de: Ein Nutzer hat einen Account an bei %(site_name)s registriert.

source: If you want allow this user to activate his account, please visit the following page
de: Falls Sie dem Nutzer erlauben möchten seinen Account zu aktivieren, dann gehen Sie auf folgende Seite

source: Upon visiting that page, the user will be sent his activation key
de: Nach Besuch der Seite wird dem Nutzer der Aktischlüssel gesendet

source: The %(site_name)s team will shortly validate your registration. You will then receive a mail with your activation key.
de: Das %(site_name)s Team wird in Kürze Ihre Registrierung prüfen. Sie erhalten eine E-Mail mit dem Aktivierungsschlüssel.

source: Register a new Account
de: Neuen Account registrieren

source: The username you choose will also be your public name for the forum and can not be changed after registration.
de: Der Benutzername den Sie wählen kann nach der Registration nicht geändert werden.

source: passed, failed
de: bestanden, durchgefallen

source: All required tests have been passed. Nevertheless there is at least one warning
de: Alle nötigen Tests wurden bestanden. Es gibt allerdings Warnungen

source: You should consider correcting it.
de: Sie sollten eine Korrektur vornehmen.

source: All required tests have been passed.
de: Alle nötigen Tests wurden bestanden.

source: Not all required tests have been passed.
de: Nicht alle nötigen Tests wurden bestanden.

source: Please correct the errors below and try again!
de: Bitte korrigieren Sie die angezeigten Fehler und versuchen Sie es nocheinmal!

source: Results
de: Ergebnisse

source: Time left:
de: Restzeit:

source: Upload solution
de: Lösung hochladen

source: A student couldn't upload now because:
de: Ein Student konnte nicht hochladen weil:

source: upload time has passed!
de: Zeit zum Hochladen ist vorüber!

source: the limit of allowed submissions has been reached.
de: Die Anzahl der erlaubeten Einreichungen wurde überschritten.

source: Upload solution denied
de: Hochladen der Lösung untersagt

source: You have reached the limit of allowed submissions for this task.
de: Sie haben die Anzahl der erlaubten Einreichungen für die Aufgabe überschritten.

source: But you can resubmit a former upload out of Solution History.
de: Sie können aber eine früher hochgeladene Lösung aus dem Verlauf wieder einreichen.

source: the current wait-time is:
de: Die aktuelle Wartedauer beträgt:

source: Upload solution denied for now
de: Hochladen der Lösung derzeit untersagt

source: tries left
de: Versuche offen

source: Your current wait-time is:
de: Ihre aktuelle Wartedauer beträgt:

source: A student couldn't upload now because: upload time has passed!
de: Ein Student konnte nicht hochladen, da die Zeit zum Hochladen abgelaufen ist!

source: The deadline has passed. Therefore (re)submission is not possible.
de: Der Abgabetermin wurde erreicht. Daher ist ein (Wieder)Einreichen nicht möglich.

source: Final Solution
de: Letzte (Finale) Lösung

source: There is no final solution.
de: Keine finale Lösung vorhanden.

source: Solution History
de: Lösungsverlauf

source: No solutions have been uploaded.
de: Es wurden keine Lösungen hochgeladen.

source: Attestations
de: Bescheinigungen

source: My Solutions
de: Meine Lösungen

source: Expired tasks
de: Abgelaufene Aufgaben

source: Upcoming tasks
de: Anstehende Aufgaben

source: Solution
de: Lösung

source: Solutions
de: Lösungen

source: No tasks to be submitted at the moment.
de: Momentan sind keine Aufgaben vorhanden.

source: Messages
de: Mitteilungen

source: Static Files
de: Statische Dateien

source: Enter a valid value.
de: Bitte einen gültigen Wert eingeben.

source: Enter a valid URL.
de: Bitte eine gültige Adresse eingeben.

source: Enter a valid integer.
de: Bitte eine gültige Ganzzahl eingeben.

source: Enter a valid email address.
de: Bitte gültige E-Mail-Adresse eingeben.

source: Enter a valid 'slug' consisting of letters, numbers, underscores or hyphens.
de: Bitte ein gültiges Kürzel, bestehend aus Buchstaben, Ziffern, Unter- und Bindestrichen, eingeben.

source: Enter a valid IPv4 address.
de: Bitte eine gültige IPv4-Adresse eingeben.

source: Enter a valid IPv6 address.
de: Eine gültige IPv6-Adresse eingeben.

source: Enter a valid IPv4 or IPv6 address.
de: Eine gültige IPv4- oder IPv6-Adresse eingeben

source: Enter only digits separated by commas.
de: Bitte nur durch Komma getrennte Ziffern eingeben.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
de: Bitte sicherstellen, dass der Wert %(limit_value)s ist. (Er ist %(show_value)s)

source: Ensure this value is less than or equal to %(limit_value)s.
de: Dieser Wert muss kleiner oder gleich %(limit_value)s sein.

source: Ensure this value is greater than or equal to %(limit_value)s.
de: Dieser Wert muss größer oder gleich %(limit_value)s sein.

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
de: Bitte sicherstellen, dass der Wert aus mindestens %(limit_value)d Zeichen besteht. (Er besteht aus %(show_value)d Zeichen).

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
de: Bitte sicherstellen, dass der Wert aus höchstens %(limit_value)d Zeichen besteht. (Er besteht aus %(show_value)d Zeichen).

source: and
de: und

source: %(model_name)s with this %(field_labels)s already exists.
de: %(model_name)s mit diesem %(field_labels)s existiert bereits.

source: Value %(value)r is not a valid choice.
de: Wert %(value)r ist keine gültige Option.

source: This field cannot be null.
de: Dieses Feld darf nicht null sein.

source: This field cannot be blank.
de: Dieses Feld darf nicht leer sein.

source: %(model_name)s with this %(field_label)s already exists.
de: %(model_name)s mit diesem %(field_label)s existiert bereits.

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
de: %(field_label)s muss für %(date_field_label)s %(lookup_type)s eindeutig sein.

source: Field of type: %(field_type)s
de: Feldtyp: %(field_type)s

source: Integer
de: Ganzzahl

source: '%(value)s' value must be an integer.
de: ‚%(value)s‛ Wert muss eine Ganzzahl sein.

source: '%(value)s' value must be either True or False.
de: ‚%(value)s‛ Wert muss entweder True oder False sein.

source: Boolean (Either True or False)
de: Boolescher Wert (True oder False)

source: String (up to %(max_length)s)
de: Zeichenkette (bis zu %(max_length)s Zeichen)

source: Comma-separated integers
de: Kommaseparierte Liste von Ganzzahlen

source: '%(value)s' value has an invalid date format. It must be in YYYY-MM-DD format.
de: ‚%(value)s‛ Wert hat ein ungültiges Datumsformat. Es muss YYYY-MM-DD entsprechen.

source: '%(value)s' value has the correct format (YYYY-MM-DD) but it is an invalid date.
de: ‚%(value)s‛ hat das korrekte Format (YYYY-MM-DD) aber ein ungültiges Datum.

source: Date (without time)
de: Datum (ohne Uhrzeit)

source: '%(value)s' value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
de: ‚%(value)s‛ Wert hat ein ungültiges Format. Es muss YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] entsprechen.

source: '%(value)s' value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
de: ‚%(value)s‛ Wert hat das korrekte Format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) aber eine ungültige Zeit-/Datumsangabe.

source: Date (with time)
de: Datum (mit Uhrzeit)

source: '%(value)s' value must be a decimal number.
de: ‚%(value)s‛ Wert muss eine Dezimalzahl sein.

source: Decimal number
de: Dezimalzahl

source: '%(value)s' value has an invalid format. It must be in [DD] [HH:[MM:]]ss[.uuuuuu] format.
de: '%(value)s' Wert hat ein ungültiges Format. Es muss der Form [DD] [HH:[MM:]]ss[.uuuuuu] entsprechen.

source: Duration
de: Zeitspanne

source: Email address
de: E-Mail-Adresse

source: File path
de: Dateipfad

source: '%(value)s' value must be a float.
de: ‚%(value)s‛ Wert muss eine Fließkommazahl sein.

source: Floating point number
de: Gleitkommazahl

source: Big (8 byte) integer
de: Große Ganzzahl (8 Byte)

source: IPv4 address
de: IPv4-Adresse

source: IP address
de: IP-Adresse

source: '%(value)s' value must be either None, True or False.
de: ‚%(value)s‛ Wert muss entweder None, True oder False sein.

source: Boolean (Either True, False or None)
de: Boolescher Wert (True, False oder None)

source: Positive integer
de: Positive Ganzzahl

source: Positive small integer
de: Positive kleine Ganzzahl

source: Slug (up to %(max_length)s)
de: Kürzel (bis zu %(max_length)s)

source: Small integer
de: Kleine Ganzzahl

source: '%(value)s' value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
de: ‚%(value)s‛ Wert hat ein ungültiges Format. Es muss HH:MM[:ss[.uuuuuu]] entsprechen.

source: '%(value)s' value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
de: ‚%(value)s‛ Wert hat das korrekte Format (HH:MM[:ss[.uuuuuu]]) aber ist eine ungültige Zeitangabe.

source: Time
de: Zeit

source: URL
de: Adresse (URL)

source: Raw binary data
de: Binärdaten

source: '%(value)s' is not a valid UUID.
de: Wert '%(value)s' ist keine gültige UUID.

source: File
de: Datei

source: Image
de: Bild

source: %(model)s instance with %(field)s %(value)r does not exist.
de: Objekt vom Typ %(model)s mit %(field)s %(value)r existiert nicht.

source: Foreign Key (type determined by related field)
de: Fremdschlüssel (Typ definiert durch verknüpftes Feld)

source: One-to-one relationship
de: 1:1-Beziehung

source: Many-to-many relationship
de: n:m-Beziehung

source: This field is required.
de: Dieses Feld ist zwingend erforderlich.

source: Enter a whole number.
de: Bitte eine ganze Zahl eingeben.

source: Enter a number.
de: Bitte eine Zahl eingeben.

source: Ensure that there are no more than %(max)s digit in total.
de: Bitte sicherstellen, dass der Wert höchstens %(max)s Ziffer enthält.

source: Ensure that there are no more than %(max)s decimal place.
de: Bitte sicherstellen, dass der Wert höchstens %(max)s Dezimalstelle enthält.

source: Ensure that there are no more than %(max)s digit before the decimal point.
de: Bitte sicherstellen, dass der Wert höchstens %(max)s Ziffer vor dem Komma enthält.

source: Enter a valid date.
de: Bitte ein gültiges Datum eingeben.

source: Enter a valid time.
de: Bitte eine gültige Uhrzeit eingeben.

source: Enter a valid date/time.
de: Bitte ein gültiges Datum und Uhrzeit eingeben.

source: Enter a valid duration.
de: Bitte eine gültige Zeitspanne eingeben.

source: No file was submitted. Check the encoding type on the form.
de: Es wurde keine Datei übertragen. Überprüfen Sie das Encoding des Formulars.

source: No file was submitted.
de: Es wurde keine Datei übertragen.

source: The submitted file is empty.
de: Die übertragene Datei ist leer.

source: Ensure this filename has at most %(max)d character (it has %(length)d).
de: Bitte sicherstellen, dass der Dateiname aus höchstens %(max)d Zeichen besteht. (Er besteht aus %(length)d Zeichen).

source: Please either submit a file or check the clear checkbox, not both.
de: Bitte wählen Sie entweder eine Datei aus oder wählen Sie "Löschen", nicht beides.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
de: Bitte ein gültiges Bild hochladen. Die hochgeladene Datei ist kein Bild oder ist defekt.

source: Select a valid choice. %(value)s is not one of the available choices.
de: Bitte eine gültige Auswahl treffen. %(value)s ist keine gültige Auswahl.

source: Enter a list of values.
de: Bitte eine Liste mit Werten eingeben.

source: Enter a complete value.
de: Bitte einen vollständigen Wert eingeben.

source: Enter a valid UUID.
de: Bitte eine gültige UUID eingeben.

source: (Hidden field %(name)s) %(error)s
de: (Verstecktes Feld %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with
de: ManagementForm-Daten fehlen oder wurden manipuliert.

source: Please submit %d or fewer forms.
de: Bitte höchstens %d Formular abschicken.

source: Please submit %d or more forms.
de: Bitte %d oder mehr Formulare abschicken.

source: Order
de: Reihenfolge

source: Delete
de: Löschen

source: Please correct the duplicate data for %(field)s.
de: itte die doppelten Daten für %(field)s korrigieren.

source: Please correct the duplicate data for %(field)s, which must be unique.
de: Bitte die doppelten Daten für %(field)s korrigieren, das eindeutig sein muss.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
de: Bitte die doppelten Daten für %(field_name)s korrigieren, da es für %(lookup)s in %(date_field)s eindeutig sein muss.

source: Please correct the duplicate values below.
de: Bitte die unten aufgeführten doppelten Werte korrigieren.

source: The inline foreign key did not match the parent instance primary key.
de: Der Inline-Fremdschlüssel passt nicht zum Primärschlüssel der übergeordneten Instanz.

source: Select a valid choice. That choice is not one of the available choices.
de: Bitte eine gültige Auswahl treffen. Dies ist keine gültige Auswahl.

source: "%(pk)s" is not a valid value for a primary key.
de: "%(pk)s" ist kein gültiger Wert für einen Primärschlüssel.

source: %(datetime)s couldn't be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
de: %(datetime)s konnte mit der Zeitzone %(current_timezone)s nicht eindeutig interpretiert werden, da es doppeldeutig oder eventuell inkorrekt ist.

source: Currently
de: Derzeit

source: Change
de: Ändern

source: Clear
de: Zurücksetzen

source: Unknown
de: Unbekannt

source: Yes
de: Ja

source: No
de: Nein

source: yes,no,maybe
de: Ja,Nein,Vielleicht

source: p.m.
de: nachm.

source: a.m.
de: vorm.

source: PM
de: nachm.

source: AM
de: vorm.

source: midnight
de: Mitternacht

source: noon
de: Mittag

source: Monday
de: Montag

source: Tuesday
de: Dienstag

source: Wednesday
de: Mittwoch

source: Thursday
de: Donnerstag

source: Friday
de: Freitag

source: Saturday
de: Samstag

source: Sunday
de: Sonntag

source: Mon
de: Mo

source: Tue
de: Di

source: Wed
de: Mi

source: Thu
de: Do

source: Fri
de: Fr

source: Sat
de: Sa

source: Sun
de: So

source: January
de: Januar

source: February
de: Februar

source: March
de: März

source: May
de: Mai

source: June
de: Juni

source: July
de: Juli

source: October
de: Oktober

source: December
de: Dezember

source: mar
de: Mär

source: may
de: Mai

source: oct
de: Okt

source: dec
de: Dez

# abbrev. month
source: March
de: März

# abbrev. month
source: May
de: Mai

# abbrev. month
source: June
de: Juni

# abbrev. month
source: July
de: Juli

# abbrev. month
source: Oct.
de: Okt.

# abbrev. month
source: Dec.
de: Dez.

# alt. month
source: January
de: Januar

# alt. month
source: February
de: Februar

# alt. month
source: March
de: März

# alt. month
source: May
de: Mai

# alt. month
source: June
de: Juni

# alt. month
source: July
de: Juli

# alt. month
source: October
de: Oktober

# alt. month
source: December
de: Dezember

source: This is not a valid IPv6 address.
de: Dies ist keine gültige IPv6-Adresse.

source: or
de: oder

source: %d year
de: %d Jahr

source: %d month
de: %d Monat

source: %d week
de: %d Woche

source: %d day
de: %d Tag

source: %d hour
de: %d Stunde

source: 0 minutes
de: 0 Minuten

source: Forbidden
de: Verboten

source: CSRF verification failed. Request aborted.
de: CSRF-Verifizierung fehlgeschlagen. Anfrage abgebrochen.

source: You are seeing this message because this HTTPS site requires a 'Referer header' to be sent by your Web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
de: Sie sehen diese Fehlermeldung da diese HTTPS-Seite einen „Referer“-Header von Ihrem Webbrowser erwartet, aber keinen erhalten hat. Dieser Header ist aus Sicherheitsgründen notwendig, um sicherzustellen, dass Ihr Webbrowser nicht von Dritten missbraucht wird.

source: If you have configured your browser to disable 'Referer' headers, please re-enable them, at least for this site, or for HTTPS connections, or for 'same-origin' requests.
de: Falls Sie Ihren Webbrowser so konfiguriert haben, dass „Referer“-Header nicht gesendet werden, müssen Sie diese Funktion mindestens für diese Seite, für sichere HTTPS-Verbindungen oder für „Same-Origin“-Verbindungen reaktivieren.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
de: Sie sehen Diese Nachricht, da diese Seite einen CSRF-Cookie beim Verarbeiten von Formulardaten benötigt. Dieses Cookie ist aus Sicherheitsgründen notwendig, um sicherzustellen, dass Ihr Webbrowser nicht von Dritten missbraucht wird.

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for 'same-origin' requests.
de: Falls Sie Cookies in Ihren Webbrowser deaktiviert haben, müssen Sie sie midestens für diese Seite oder für „Same-Origin“-Verbindungen reaktivieren.

source: More information is available with DEBUG=True.
de: Mehr Information ist verfügbar mit DEBUG=True.

source: Welcome to Django
de: Willkommen zu Django

source: It worked!
de: Es hat geklappt!

source: Congratulations on your first Django-powered page.
de: Herzlichen Glückwunsch zur ersten Django-basierten Seite.
